app/Controllers/Admin.php

    public function dashboard()
{
    $billingModel = new BillingModel();

    $data = [
        'title'        => 'Admin Dashboard',
        'total_users'  => $this->userModel->where('role', 'user')->countAllResults(),
        'total_admins' => $this->userModel->where('role', 'admin')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'