app/Controllers/User.php

SELECT *
FROM `clients`
---
    public function getClients()
    {
        $clients = $this->clientModel->findAll();