app/Models/AuditModel.php

SELECT `a`.*, `u`.`full_name`, `u`.`username`, `u`.`role`
FROM `audit_trails` `a`
JOIN `users` `u` ON `u`.`id` = `a`.`user_id`
ORDER BY `a`.`created_at` DESC
---
    public function getAll()
    {
        return $this->db->table('audit_trails a')
            ->select('a.*, u.full_name, u.username, u.role')
            ->join('users u', 'u.id = a.user_id')
            ->orderBy('a.created_at', 'DESC')
            ->get()
            ->getResultArray();