app/Models/BillingModel.php

SELECT `b`.*, `c`.`full_name` AS `client_name`, `c`.`client_no`, `c`.`meter_no`, `u`.`full_name` AS `computed_by_name`
FROM `billings` `b`
JOIN `clients` `c` ON `c`.`id` = `b`.`client_id`
JOIN `users` `u` ON `u`.`id` = `b`.`computed_by`
WHERE `b`.`computed_by` = 2
ORDER BY `b`.`created_at` DESC
---
    public function getByUser(int $userId)
    {
        return $this->db->table('billings b')
            ->select('b.*, c.full_name AS client_name, c.client_no, c.meter_no, u.full_name AS computed_by_name')
            ->join('clients c', 'c.id = b.client_id')
            ->join('users u',   'u.id = b.computed_by')
            ->where('b.computed_by', $userId)
            ->orderBy('b.created_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT `b`.*, `c`.`full_name` AS `client_name`, `c`.`client_no`, `c`.`meter_no`, `u`.`full_name` AS `computed_by_name`
FROM `billings` `b`
JOIN `clients` `c` ON `c`.`id` = `b`.`client_id`
JOIN `users` `u` ON `u`.`id` = `b`.`computed_by`
ORDER BY `b`.`created_at` DESC
---
    public function getAll()
    {
        return $this->db->table('billings b')
            ->select('b.*, c.full_name AS client_name, c.client_no, c.meter_no, u.full_name AS computed_by_name')
            ->join('clients c', 'c.id = b.client_id')
            ->join('users u',   'u.id = b.computed_by')
            ->orderBy('b.created_at', 'DESC')
            ->get()
            ->getResultArray();