app/Models/UserModel.php

    public function findByUsername(string $username)
    {
        return $this->where('username', $username)
                    ->where('is_active', 1)
                    ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'jdoe'
AND `is_active` = 1
 LIMIT 1

    public function getAllUsers(int $excludeId = 0)
    {
        return $this->where('id !=', $excludeId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `users`
WHERE `id` != 3
ORDER BY `created_at` DESC